{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Тест 7"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1. Алгоритм это:\n",
    "\n",
    "        б) пошаговое описание последовательности действий, которые необходимо, выполнить для решения задачи\n",
    "\n",
    "2. Свойство алгоритма, которое обеспечивает решение целого класса задач\n",
    "одного типа:\n",
    "\n",
    "        г) массовость.\n",
    "\n",
    "3. Как называется конструкция блок-схемы, изображенная на рисунке?\n",
    "\n",
    "        а) вызов вспомогательного алгоритма\n",
    "\n",
    "4. На рисунке представлена часть блок-схемы. Как она называется?\n",
    "\n",
    "        а) альтернатива.\n",
    "\n",
    "5. Определите значения переменной «x» после выполнения фрагмента\n",
    "алгоритма.\n",
    "\n",
    "        Ответ: 6\n",
    "\n",
    "6. Определите значение переменной «b» после выполнения фрагмента\n",
    "алгоритма.\n",
    "\n",
    "        Ответ: 3\n",
    "\n",
    "7. В машине Тьюринга предписание S для лентопротяжного механизма\n",
    "означает\n",
    "        \n",
    "        а) переместить ленту вправо;\n",
    "\n",
    "8. Конечный автомат – это автомат с ….\n",
    "\n",
    "        б) конечным числом состояний\n",
    "\n",
    "9. Пусть дана машина Тьюринга с внешним алфавитом ∑ = {a,b, _} и\n",
    "состояниями Q = {q0, q1, q2}. Программа приведена в таблице:\n",
    "В какое слово программа преобразует слово abb, если головка находится\n",
    "над первой буквой?\n",
    "\n",
    "        б) abbb\n",
    "\n",
    "10. Машина Тьюринга задана программой, записанной в виде таблицы:\n",
    "Определите, в какое слово машина Тьюринга преобразует слово «111», если головка находится над первой (слева направо) единицей?\n",
    "\n",
    "        а) 111"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Phyton"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1. Напишите функцию, которая на вход принимает два целых числа\n",
    "(делимое и делитель) и возвращает целую часть от деления и остаток."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Целая часть и остаток от деления: (5, 0)\n"
     ]
    }
   ],
   "source": [
    "x=int(input(\"Введите делимое\"))\n",
    "y=int(input(\"Введите делитель\"))\n",
    "def f(x,y):\n",
    "    return(x // y,x % y)\n",
    "print(f\"Целая часть и остаток от деления: {f(x,y)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2.Описать функцию Sign(X) целого типа, возвращающую для\n",
    "вещественного числа X следующие значения: −1, если X < 0; 0, если X =\n",
    "0; 1, если X > 0."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число 7 после функции Sign(x) равно: 1\n"
     ]
    }
   ],
   "source": [
    "x=int(input(\"Введите число\"))\n",
    "def Sign(x):\n",
    "    if x < 0:\n",
    "        return -1\n",
    "    if x == 0:\n",
    "        return 0\n",
    "    if x >0:\n",
    "        return 1\n",
    "print(f\"Число {x} после функции Sign(x) равно: {Sign(x)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "3. Напишите проверку на то, является ли строка палиндромом. Палиндром\n",
    "— это слово или фраза, которые одинаково читаются слева направо и\n",
    "справа налево."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Строка 'radar' является палиндромом\n"
     ]
    }
   ],
   "source": [
    "a = str(input(\"Введите вашу строку: \"))\n",
    "def f(a):\n",
    "    for i in range(len(a)):\n",
    "        if a[:i] + a[i+1:] == (a[:i] + a[i+1:])[::-1]:\n",
    "            return 1\n",
    "    return 0\n",
    "if f(a) == 1:\n",
    "    print(f\"Строка '{a}' является палиндромом\")\n",
    "else:\n",
    "    print(f\"Строка '{a}' не является палиндромом\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "4. Сделайте так, чтобы число секунд отображалось в\n",
    "видедни:часы:минуты:секунды."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "37 - д: 12 - ч: 59 - м: 3 - с\n"
     ]
    }
   ],
   "source": [
    "s = int(input(\"Введите кол-во секунд: \"))\n",
    "\n",
    "def time(s):\n",
    "    d = s // 86400\n",
    "    s %= 86400\n",
    "    h = s // 3600\n",
    "    s %= 3600\n",
    "    m = s // 60\n",
    "    s %= 60\n",
    "    \n",
    "    print(f\"{d} - д: {h} - ч: {m} - м: {s} - с\")\n",
    "\n",
    "time(s)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "5. Напишите функцию, которая вычисляет любое число Фибоначчи 𝑭𝒏с\n",
    "помощью рекурсии."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ваше число Фибоначчи: 55, при n равном 10\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.setrecursionlimit(10000)\n",
    "def f(n):\n",
    "    if n == 0:\n",
    "        return 0\n",
    "    if n == 1:\n",
    "        return 1\n",
    "    else:\n",
    "        return f(n-2)+f(n-1)\n",
    "n = int(input(\"Введите ваше n\"))\n",
    "print(f\"Ваше число Фибоначчи: {f(n)}, при n равном {n}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
